Revit 2024 API
SpecTypeId.ColorTemperature Property
 Color Temperature, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId ColorTemperature { get; }
Visual Basic
Public Shared ReadOnly Property ColorTemperature As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ColorTemperature {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace